@extends('home.layouts.master')

@section('content')
    <div class="content">
        <!-- open sidebar menu -->
        <a class="btn btn-primary btn-customized open-menu" href="#" role="button">
            <i class="fas fa-align-left"></i> <span>منو</span>
        </a>

        <div class="top-content section-container" id="top-content">
            <div class="container">
                <div class="row">
                    <div class="col col-md-10 offset-md-1 col-lg-8 offset-lg-2">
                        <h1 class="wow fadeIn">

                            <strong>درباره بازرگانی اسپیدکار</strong>
                        </h1>
                        <div class="description wow fadeInLeft">
                            <p>
                                واردات و عرضه آلیاژ ها صنعتی با پشتوانه بیش از ۱۰ سال تجربه فعالیت بازرگانی و خدمات مهندسی
                                سطح

                            </p>
                        </div>
                        <div class="buttons wow fadeInUp">
                            <a class="btn btn-primary btn-customized-2 scroll-link" href="#section-3" role="button">
                                صفحه اصلی <i class="fas fa-home"></i>
                            </a>
                        </div>
                    </div>
                </div>
            </div>
        </div>

        <div class="container about-us-container">
            <div class="row py-5">
                <div class="col-md-12">
                    <h2>درباره ما</h2>
                    <div class="divider-1 wow fadeInUp"><span></span></div>
                    <p>شرکت بازرگانی اسپیدکار، با در اختیار داشتن گروه بازرگانی و مهندسی در زمینه تامین، واردات و عرضه آلیاژ
                        ها صنعتی با پشتوانه بیش از 10 سال تجربه فعالیت بازرگانی و خدمات مهندسی سطح، آماده ارایه تجهیزات،
                        مواد اولیه و آلیاژ های صنعتی تخصصی ضد سایش و ضد خوردگی در زمینه پوشش های حرارتی، جوشکاری و پوشش دهی
                        مورد نیاز صنایع کشور می باشد.</p>
                    <p>هدف این شرکت کمک به انتخاب علمی و دسترسی به آلیاژ های تخصصی و مهندسی مطابق با استاندارد های روز دنیا
                        در داخل کشور می باشد.</p>
                    <p>شرکت بازرگانی اسپیدکار با نیازسنجی و شناسایی زمینه‌های مساعد و قابل اجرا جهت فعالیت در بخش‌ها و
                        حوزه‌های مختلف صنعتی و تولیدی ایران، قدم در عرصه صنعت فلزات و آلیاژ های نوین در این کشور گذاشته و با
                        بکارگیری نیروهایی جوان، متخصص و کارامد همراه با تجاربی مناسب در بسیاری از زمینه‌های اجرایی؛ تلاش
                        دارد نقشی موثر و بسزا در بهبود، بروزرسانی و توسعه صنعت نوآور و به روز درکشور ایفا نماید.</p>
                    <p>واحد بازرگانی اسپیدکار با توجه به داشتن ارتباطات گستره با متخصصین رشته متالورژی و مکانیک در خارج از
                        کشور و اخذ نمایندگی های فروش و خدمات پس از فروش از چندین برند مطرح اروپایی و آسیایی و همکاری گسترده
                        با تامین کنندگان معتبر خارجی در بخش مواد اولیه و ماشین الات صنعت پوشش دهی، امکان تأمین طیف وسیعی از
                        قطعات، تجهیزات و ماشین‌آلات مورد نیاز در پروژه‌های صنعتی شرکت‌ها و صنایع کشور و ارائه خدمات پس از
                        فروش مناسب آنها را در کوتاه‌ترین زمان ممکن و تحت استانداردهای بین‌المللی روز دنیا را دارا می‌باشد.
                    </p>

                </div>
            </div>

            <div class="row py-3">
                <div class="col-md-12">
                    <h3>اهم قابلیت‌ها و خدمات قابل ارائه این شرکت:</h3>
                        <ul>
                            <li>نمایندگی چندین برند مطرح اروپایی در زمینه‌ مواد مصرفی و تجهیزات تخصصی پوشش دهی و جوشکاری
                            </li>
                            <li>تامین مواد مصرفی و تجهیزات پوشش های حرارتی Thermal spray</li>
                            <li>تامین مواد مصرفی و تجهیزات تخصصی جوشکاری و روکش دهی Hard facing and cladding</li>
                            <li>تامین پودر های مصرفی فرایند پرینت فلزی پودر و لیزرکلدینگ 3Dprinting and laser Cladding</li>
                            <li>تامین مواد مصرفی و تجهیزات روکش دهی پلاسمایی (PTA welding)</li>
                            <li>خدمات مشاوره در انتخاب مواد و متریال های مهندسی و تخصصی در زمینه روکش دهی سخت</li>
                            <li>واردات انواع قطعات، تجهیزات و ماشین‌آلات اعم از مکانیکی، الکتریکی و تجهیزات خاص صنایع مختلف
                                از جمله حفاری، فولادسازی و نفت و گاز</li>
                            <li>مشاوره و بازدید از خطوط صنایع مختلف با استفاده از کارگروه‌های تخصصی صنایع مربوطه و ارائه
                                راهکارهای نوین جهت بروزرسانی و افزایش راندمان و بهره‌ وری خطوط تولید</li>
                            <li>ارائه خدمات پس از فروش محصولات و مشاوره در زمینه تعمیرات و نگهداری ادواری آنها</li>
                            <li>ارائه مشاوره و راهکارهای تخصصی در زمینه انواع بازرسی‌های فنی لازم جهتواردات تجهیزات مختلف
                            </li>
                            <li>تدوین، تهیه و ارائه اسناد و مستندات فنی و اسناد و تاییدیه‌های بازرسی تجهیزات تامین شده مطابق
                                با استانداردهای روز دنیا</li>
                            <li>درج لوگوهای شرکت های خارجی به صورت نواری در پایین صفحه درباره ما و گذاشتن لینک سایت هر کدام
                                بر روی عکس</li>
                        </ul>
                </div>
            </div>
        </div>




        <footer class="footer-container">
            <div class="container">
                <div class="row">
                    <div class="col">
                        &copy; شرکت به نگاران تجارت آزما <a href=""> به نگاران تجارت آزما</a>.
                    </div>
                </div>
            </div>
        </footer>
    </div>
@endsection
