import React from "react";
import "./Introduction.css";

function Introduction() {
  return (
    <div class="container mt-5 pt-md-5 pb-5">
      <div class="row">
        <div class="col-md-8 col-sm-12 introduction-text">
          <h5>درمان سطحی (در پلاسما)</h5>
          <h1>مواد فنّاور مهر</h1>
          <p class="mt-4 mb-5">
            شرکت " مواد فناور مهر" در سال ۱۴۰۰ تاسیس شد. هر چند از تاسیس شرکت
            زمان زیادی نمی گذرد ولی بیش از ۲۰ سال سابقه علمی و صنعتی مدیر مجموعه
            در زمینه عملیات حرارتی و پوشش ( خصوصا پوشش های پلاسمایی ) پشتوانه
            حرکت رو به جلو در شرکت است. زمینه فعالیت شرکت به طور کلی عملیات
            حرارتی و پوشش دهی فلزات با تاکید ویژه بر " ساخت تجهیزات پوشش دهی
            پلاسمایی و ارائه خدمات در این زمینه" می باشد. هدف اصلی و رسالت ما
            توسعه روش های نوین عملیات حرارتی و پوشش دهی با رویکرد علمی در کشور
            بوده و با پروژه های تحقیق و توسعه، به گسترش فناوری های خود و تقویت
            موقعیت خود در صنعت ادامه می دهیم. در آینده بیش از پیش با خدمات جامع
            از مشتریان خود حمایت کرده و آنها را با بالاترین کیفیت متقاعد خواهیم
            کرد.
          </p>
        </div>

        <div class="col-md-4 col-sm-12 introduction-contact-box">
          <h5>ساعات کار</h5>
          <p>شنبه - پنجشنبه ۷:۰۰ - ۱۶:۳۰</p>
          <p>جمعه فقط با تعیین وقت قبلی</p>
          <h5>تماس</h5>
          <span>
            تلفن همراه :<a href="tel:09122285923"> ۰۹۱۲۲۲۸۵۹۲۳</a>
          </span>
          <span>
            تلفن ثابت :<a href="tel:02634700795"> ۰۲۶۳۴۷۰۰۷۹۵</a>
          </span>
          <span>
            ایمیل :
            <a href="mailto:mavadfannavarmehr@gmail.com">
              mavadfannavarmehr@gmail.com
            </a>
          </span>
        </div>
      </div>
    </div>
  );
}

export default Introduction;
