import React from "react";
import { useEffect } from "react";
import "./ServiceAndProductCard.css";
import { Col, Container } from "react-bootstrap";
import { Row } from "react-bootstrap";
import Footer from "../components/Footer";
import NitrogenPlasmaImageOne from "../assets/images/plasma-4.jpg";
import NitrogenPlasmaImageTwo from "../assets/images/plasma-2.jpg";
import NitrogenPlasmaImageThree from "../assets/images/plasma-3.jpg";
import ChartImage from "../assets/images/layer.jpg";
import NitroCarbonImage from "../assets/images/carbon.jpg";
import PostOxiditionImage from "../assets/images/oxid.jpg";
// import DeviceImageOne from "../assets/images/عکس دستگاه - 1.jpg";
import DeviceImageTwo from "../assets/images/device-2.jpg";

function ServiceAndProductCard() {
  useEffect(() => {
    const hash = window.location.hash;
    if (hash) {
      const id = hash.substring(1);
      setTimeout(() => {
        const element = document.getElementById(id);
        if (element) {
          element.scrollIntoView({ behavior: "smooth" });
        }
      }, 100); // Adjust the delay as needed
    }
  }, []);

  return (
    <>
      <Container className="servicesAndProducts__container mb-5">
        <Row className="servicesAndProducts__card">
          <h2 id="plasmaNitridingSection">
            نیتروژن‌دهی پلاسمایی (Plasma Nitriding)
          </h2>
          <p>
            نیتروژن‌دهی (نیتراسیون-نیتراته) پلاسمایی - که با عنوان نیتروژن‌دهی
            یونی و سختکاری پلاسما نیز شناخته می‌شود - فرایندی ترمو شیمیایی است
            که عمدتاً به‌منظور افزایش مقاومت به سایش، خوردگی، و خستگی قطعات فلزی
            استفاده می‌شود. نیتروژن، تحت‌تأثیر گرما، به درون سطح نفوذ می‌کند که
            منجر به دگرگونی شیمیایی سطح فلز و تشکیل نیتریدهای فلزی در سطح فلز
            می‌گردد. فرایند نیتروژن‌دهی با روش‌های حمام نمک و گازی نیز انجام
            می‌شود؛ اما از میان این روش‌ها، نیتروژن‌دهی پلاسمایی به‌دلایل
            گوناگون از جایگاه ویژه‌ای برخوردار است.
          </p>
          <p>
            نیتروژن‌دهی پلاسمایی در یک محفظهٔ خلأ انجام می‌شود. قطعات کاتد و
            محفظه آند را تشکیل می‌دهد. پس از ایجاد خلأ اولیه در محفظه، گازهای
            عملیاتی (نیتروژن، هیدروژن، آرگون، و متان) وارد محفظه می‌شوند. با
            ایجاد یک میدان الکتریکی بین قطعات و دیوارهٔ محفظه، گازها یونیزه و
            پلاسما تشکیل می‌شود. یون‌های نیتروژن در جهت قطعات (کاتد) شتاب گرفته
            و با انرژی بالایی به سطوح قطعات برخورد می‌کنند. بمباران یونی باعث
            گرم‌‌شدن، تمیزشدن، و جذب نیتروژن در سطوح قطعات می‌شود.
          </p>
          <Row md={3} className="servicesAndProducts__image">
            <Col xs={12}>
              <img src={NitrogenPlasmaImageTwo} alt="" />
            </Col>
            <Col xs={12}>
              <img src={NitrogenPlasmaImageOne} alt="" />
            </Col>
            <Col xs={12}>
              <img src={NitrogenPlasmaImageThree} alt="" />
            </Col>
          </Row>
          <h4>لایهٔ نیتروژن‌دهی (Nitriding Layer)</h4>
          <p>
            لایهٔ نیتروژن‌دهی شامل دو قسمت اصلی است: لایهٔ بیرونی که به آن لایهٔ
            سفید یا ترکیبی (Compound Layer - White Layer) می‌گویند و لایهٔ داخلی
            که به آن لایهٔ نفوذی (Diffusion Layer) گفته می‌شود. لایهٔ سفید از
            نیتریدهای آهن اپسیلون (ε-Fe2-3N) و گاما پرایم (γ'-Fe4N) تشکیل شده
            است و ضخامت آن چند میکرون است. در مقایسه با روش‌های دیگر
            نیتروژن‌دهی، لایهٔ سفید ایجادشده در نیتروژن‌دهی پلاسمایی به‌دلیل
            فشرده‌تربودن و تخلخل کمتر، دارای خواص بهتری است. در زیر لایهٔ سفید،
            لایهٔ نفوذی وجود دارد که شامل فلز پایه و نیتریدهای تشکیل‌شده است و
            ضخامت آن به چندصد میکرون می‌رسد. هرچه عناصر تشکیل‌دهندهٔ نیترید
            (آلومینیوم، کرم، مولیبدن، منگنز، وانادیم، و تیتانیم) در ساختار فولاد
            بیشتر باشد، سختی سطحی به‌دست‌آمده بیشتر خواهد بود. به همین دلیل،
            سختی به‌دست‌آمده در نیتروژن‌دهی فولادهای غیرآلیاژی تنها ۲۵۰-۳۰۰
            ویکرز بوده، درحالی‌که سختی به‌دست‌آمده در نیتروژن‌دهی فولادهای
            کم‌آلیاژ ۶۰۰-۷۰۰ ویکرز و فولادهای پرآلیاژ ۱۲۰۰-۸۰۰ ویکرز است.
          </p>
          <p>
            علاوه بر سختی، مشخصهٔ دیگر لایهٔ نیتروژن‌دهی عمق نفوذ سختی است.
            براساس استانداردDIN 50190 part 3، عمق نفوذ سختی (NHT) به فاصله‌ای از
            سطح گفته می‌شود که سختی حداقل ۵۰ ویکرز از سختی پایه بالاتر باشد.
            استانداردهای دیگری نیز برای تعریف عمق نفوذ وجود دارد، به همین دلیل
            استاندارد مورداستفاده باید پیش از انجام کار، به توافق کارفرما و
            پیمانکار برسد.
          </p>
          <Row className="servicesAndProducts__image">
            <Col>
              <img src={ChartImage} alt="" />
            </Col>
          </Row>
          <ul>
            <h3>مزیت های نیتروژن‌دهی پلاسمایی</h3>
            <li> دمای پایین فرایند </li>
            <li> تغییر ابعادی بسیار کم</li>
            <li> امکان نیتروژن‌دهی انتخابی</li>
            <li>
              امکان فعال‌سازی و تمیزکاری سطوح در پلاسما که منجر به افزایش کیفیت
              لایهٔ ایجادشده می‌شود
            </li>
            <li>
              کمتربودن تخلخل و شکنندگی لایهٔ ایجادشده نسبت به لایه‌های تشکیل‌شده
              در روش‌های گازی و حمام نمک
            </li>
            <li> امکان سازگار‌کردن ساختار لایه با تنش واردشده به قطعه</li>
            <li> زمان پایین‌تر فرایند نسبت به روش گازی</li>
            <li> عدم نیاز به تمیزکاری و پولیش نهایی به‌علت کیفیت بالای سطحی</li>
            <li> امکان انجام فرایند روی فولادهای ضد زنگ </li>
            <li> سازگاری با محیط زیست</li>
          </ul>
        </Row>

        <Row className="servicesAndProducts__card mt-5">
          <h2 id="plasmaNitrocarburizing">
            نیتروژن-کربن‌دهی پلاسمایی (Plasma Nitrocarburizing)
          </h2>
          <p>
            در فرایند نیتروژن-کربن‌دهی (نیتروکربوره) پلاسمایی علاوه بر نیتروژن،
            کربن نیز در سطح نفوذ می‌کند. به‌دلیل حضور کربن، در این فرایند یک
            لایهٔ سفید (ترکیبی) ضخیم‌تر با مقاومت سایشی بالاتر (نسبت به
            نیتروژن‌دهی پلاسمایی) تشکیل می‌شود. بنابراین، در مواردی که سایش شدید
            وجود دارد، این فرایند توصیه می‌شود. فولادهای غیرآلیاژی و فولادهای
            کم‌آلیاژ با محتوای کربن کم برای این فرایند مناسب هستند.
            نیتروکربوره‌کردن پلاسمایی اغلب به‌عنوان نوعی نیتروژن‌دهی پلاسمایی با
            حضور کربن طبقه‌بندی می‌شود، چراکه مکانیزم‌های اصلی فرایند یکسان
            هستند. در مورد فولادهای کم‌آلیاژ، افزایش سختی نسبت به نیتروژن‌دهی
            پلاسمایی اندک است، ولی مقاومت به خوردگی افزایش یافته و سایش چسبنده
            (Adhesive Wear) کاهش می‌یابد.
          </p>
          <Row className="servicesAndProducts__image">
            <Col>
              <img src={NitroCarbonImage} alt="" />
            </Col>
          </Row>
        </Row>

        <Row className="servicesAndProducts__card mt-5">
          <h2 id="postOxidation">اکسیداسیون تکمیلی (Post Oxidation)</h2>
          <p>
            اکسیداسیون تکمیلی به‌دنبال فرایند نیتروژن‌دهی یا نیتروژن-کربن‌دهی
            پلاسمایی انجام می‌شود. در این فرایند، یک لایهٔ نازک اکسیدی (۱-۲
            میکرومتر مگنتیت/Fe3O4) ایجاد می‌شود که ظاهری سیاه‌رنگ به قطعه داده و
            مقاومت به خوردگی قطعه را به‌طور قابل‌ملاحظه‌ای افزایش می‌دهد. لایهٔ
            اکسیدی عمدتاً از تبدیل قسمت‌های سطحی لایهٔ ترکیبی در مجاورت اکسیژن
            به‌وجود می‌آید. بنابراین، این روش تنها به‌دنبال نیتروژن‌دهی یا
            نیتروژن-کربن‌دهی قابل‌اجراست و بر روی قطعهٔ خام قابلیت اجرا ندارد.
          </p>
          <Row className="servicesAndProducts__image">
            <Col>
              <img src={PostOxiditionImage} alt="" />
            </Col>
          </Row>
        </Row>

        <Row className="servicesAndProducts__card mt-5">
          <h2>دستگاه نیتروژن‌دهی پلاسمایی</h2>
          <p>
            دستگاه‌های نیتروژن‌دهی پلاسمایی به دو دستهٔ کلی دیوارهٔ گرم و
            دیوارهٔ سرد تقسیم می‌شوند.
          </p>
          <h4 id="coldWallDevice">دستگاه نیتروژن‌دهی پلاسمایی دیوارهٔ سرد</h4>
          <p>
            دستگاه‌های دیوارهٔ سرد مکانیزم ساده‌ای دارند. محفظهٔ کوره دو جداره و
            آبگرد بوده و قطعات تنها با انرژی پلاسما گرم می‌شوند. هزینهٔ پایین،
            ساده‌بودن تعمیر و نگهداری، و مصرف کمتر انرژی از مزایای این نوع
            دستگاه می‌باشد. این نوع دستگاه برای نیتروژن‌دهی قطعات با شکل و ابعاد
            یکسان مناسب است. درحال حاضر، امکان ساخت کورهٔ دیوارهٔ سرد با هر
            ابعادی در شرکت «مواد فنّاور مهر» وجود دارد. دستگاه‌های ساخته‌شده در
            این مجموعه کاملاً اتوماتیک بوده و تمام الزامات فنی استاندارد
            این‌گونه دستگاه‌ها را پشتیبانی می‌کنند.
          </p>
          {/* <Row className="servicesAndProducts__image">
          <Col>
          <img src={DeviceImageOne} alt="" />
          </Col>
        </Row> */}
          <h4 id="hotWallDevice">دستگاه نیتروژن‌دهی پلاسمایی دیوارهٔ گرم</h4>
          <p>
            در کوره‌های دیوارهٔ گرم، حرارت‌دادن قطعات هم به‌وسیلهٔ انرژی پلاسما
            و هم به‌وسیلهٔ المنت‌های روی دیوارهٔ کوره انجام می‌شود. برحسب ابعاد
            کوره، دیوارهٔ محفظه به دو یا سه منطقهٔ حرارتی مستقل تقسیم می‌شود.
            به‌علت کم‌بودن انرژی پلاسما، امکان نیتروژن‌دهی قطعات با ابعاد و
            اشکال مختلف در یک شارژ وجود دارد. به‌دلیل قابلیت بهتر کنترل
            پارامترهای الکتریکی، در این نوع کوره‌ها بهتر می‌توان مشخصات لایه را
            کنترل کرد.
          </p>
          <Row className="servicesAndProducts__image">
            <Col>
              <img src={DeviceImageTwo} alt="" />
            </Col>
          </Row>
          <ul>
            <h3>مزایای دستگاه دیوارهٔ گرم</h3>
            <li>همگن‌بودن حرارت در کل قطعات</li>
            <li>
              کمتربودن آسیب‌های مکانیکی و متالورژیکی روی قطعات به‌دلیل کم‌بودن
              انرژی پلاسما
            </li>
            <li>همگن‌بودن لایه در قسمت‌های مختلف قطعه</li>
          </ul>
          <p>
            درحال حاضر، امکان ساخت دستگاه دیوارهٔ گرم با هر ابعادی در شرکت «مواد
            فنّاور مهر» وجود دارد. دستگاه‌های ساخته‌شده در این مجموعه کاملاً
            اتوماتیک بوده و تمام الزامات فنی استاندارد این‌گونه دستگاه‌ها را
            پشتیبانی می‌کنند.
          </p>
        </Row>
      </Container>
      <Footer />
    </>
  );
}

export default ServiceAndProductCard;
